{
  "architectures": [
    "MiniMindForCausalLM"
  ],
  "bos_token_id": 1,
  "dropout": 0.0,
  "dtype": "float32",
  "eos_token_id": 2,
  "flash_attn": true,
  "head_dim": 96,
  "hidden_act": "silu",
  "hidden_size": 768,
  "inference_rope_scaling": false,
  "intermediate_size": 2432,
  "max_position_embeddings": 32768,
  "max_seq_len": 1792,
  "model_type": "minimind",
  "moe_intermediate_size": 2432,
  "norm_topk_prob": true,
  "num_attention_heads": 8,
  "num_experts": 4,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 8,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.0005,
  "transformers_version": "4.57.6",
  "use_moe": false,
  "vocab_size": 6400
}
